### quest
-  pclass(범주/범주) 
-  sex(범주/범주)
-  age(범주/연속형)
-  각자 비교 사이즈(record)수는 같아야 한다.

In [1]:
import matplotlib.pyplot as plt
import matplotlib as mpl
mpl.rc('font',family='Malgun Gothic')
import seaborn as sns
import pandas as pd
import scipy.stats as stats

df_titanic = pd.read_csv('../../datasets/TitanicFromDisaster_train.csv')
df_titanic[:2]

#### X 범주형 , Y 범주형 : 주로 독립성 증명
### 선정 변수 : Sex, Survived
- 분석 내용 : 성별에 따라 생존 여부가 달라지는가?
     - 귀무가설 : 성별에 따라 생존 여부가 달라지지 않는다.
     - 대립가설 : 성별에 따라 생존 여부가 달라진다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 귀무가설 기각 statistic=260, pvalue=1.1e-58,
    - 사실 결론 : 성별에 따라 생존 여부가 달라진다. P.value < 0.05 : 대립 참

In [5]:
# 데이터 변환
df_titanic[['Survived','Pclass']] = df_titanic[['Survived','Pclass']].astype(object)

#### 생존과 성별 ['Survived', 'Sex']

#### X 범주형 , Y 범주형 : 주로 독립성 증명
### 선정 변수 : Sex, Survived
- 분석 내용 : 성별에 따라 생존 여부가 달라지는가?
     - 귀무가설 : 성별에 따라 생존 여부가 달라지지 않는다.
     - 대립가설 : 성별에 따라 생존 여부가 달라진다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 귀무가설 기각 statistic=260, pvalue=1.1e-58,
    - 사실 결론 : 성별에 따라 생존 여부가 달라진다. P.value < 0.05 : 대립 참

In [6]:
df_titanic[['Survived', 'Sex']].describe()

        Survived   Sex
count        891   891
unique         2     2
top            0  male
freq         549   577

In [7]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

In [8]:
df_titanic_category = df_titanic[['Survived', 'Sex']]
df_titanic_category

    Survived     Sex
0          0    male
1          1  female
2          1  female
3          1  female
4          0    male
..       ...     ...
886        0    male
887        1  female
888        0  female
889        1    male
890        0    male

[891 rows x 2 columns]

In [9]:
df_titanic_category.isnull().sum()

Survived    0
Sex         0
dtype: int64

In [10]:
df_titanic_category_pivot = pd.pivot_table(data=df_titanic_category, index='Sex' , columns='Survived', aggfunc=len) # aggfunc=len -> count
df_titanic_category_pivot

Survived    0    1
Sex
female     81  233
male      468  109

In [11]:
stats.chi2_contingency(observed=df_titanic_category_pivot, correction=True) #data는 집계된 data로, correction는 자유도

Chi2ContingencyResult(statistic=260.71702016732104, pvalue=1.1973570627755645e-58, dof=1, expected_freq=array([[193.47474747, 120.52525253],
       [355.52525253, 221.47474747]]))

#### 생존과 P_CLASS['Survived', 'Pclass']

### X: 연속형 / Y:연속형 : 주로 상관관계 확인
- correlation coefficient(상관계수)
    - 1 ~ 1
    - 0에 가까우면 관계없음, -1로 갈수록 반비례, 1로 갈수로 정비례
##### 선정 변수: age, Fare
- 분석 내용 : 나이에 따라서 비용 변화가 있는가?
    - 귀무가설 : 나이에 따라서 요금 변화가 없다.
    - 대립가설 : 나이에 따라서 요금 변화가 있다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 상관계수 비례관계
    - 사실 결론 : 나이에 따라서 요금이 올라간다.statistic=0.096, p-value=0.01)

In [13]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

In [14]:
df_titanic[['Survived','Pclass']].describe()

        Survived  Pclass
count        891     891
unique         2       3
top            0       3
freq         549     491

In [15]:
df_Pclass = df_titanic[['Survived','Pclass']]
df_Pclass[:2]

  Survived Pclass
0        0      3
1        1      1

In [16]:
df_Pclass.isnull().sum()

Survived    0
Pclass      0
dtype: int64

In [17]:
df_Pclass = df_Pclass.dropna().copy()

In [18]:
df_Pclass.isnull().sum()

Survived    0
Pclass      0
dtype: int64

In [23]:
df_Pclass.corr(numeric_only=True)
df_Pclass

    Survived Pclass
0          0      3
1          1      1
2          1      3
3          1      1
4          0      3
..       ...    ...
886        0      2
887        1      1
888        0      3
889        1      1
890        0      3

[891 rows x 2 columns]


#### 생존(범주형)과 나이(연속형) ['Survived', 'age']

### X: 나이(연속형) / Y:생존(범주형) : 주로 상관관계 확인
- correlation coefficient(상관계수)
    - 1 ~ 1
    - 0에 가까우면 관계없음, -1로 갈수록 반비례, 1로 갈수로 정비례
##### 선정 변수: age, survived
- 분석 내용 : 나이에 따라서 비용 변화가 있는가?
    - 귀무가설 : 나이에 따라서 요금 변화가 없다.
    - 대립가설 : 나이에 따라서 요금 변화가 있다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 상관계수 비례관계
    - 사실 결론 : 나이에 따라서 요금이 올라간다.statistic=0.096, p-value=0.01)

In [30]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

In [31]:
df_titanic[['Survived','Age']].describe()

              Age
count  714.000000
mean    29.699118
std     14.526497
min      0.420000
25%     20.125000
50%     28.000000
75%     38.000000
max     80.000000

In [33]:
df_age = df_titanic[['Survived','Age']]
df_age[:2]

  Survived   Age
0        0  22.0
1        1  38.0

In [34]:
df_age.isnull().sum()

Survived      0
Age         177
dtype: int64

In [35]:
df_age.isnull().sum()

Survived      0
Age         177
dtype: int64